In [1]:
import pandas as pd

# 1. creating a data frame

In [2]:
# Create a dataframe from a list of dictionaries
rectangles = [
    { 'height': 40, 'width': 10 },
    { 'height': 20, 'width': 9 },
    { 'height': 3.4, 'width': 4 }
]

rectangles_df = pd.DataFrame(rectangles)
rectangles_df

   height  width
0    40.0     10
1    20.0      9
2     3.4      4

# 2. Apply function

Use .apply with axis=1 to send every single row to a function

In [3]:
# Use the height and width to calculate the area
def calculate_area(row):
    return row['height'] * row['width']

rectangles_df.apply(calculate_area, axis=1)

0    400.0
1    180.0
2     13.6
dtype: float64

# 3. read csv

In [4]:
df=pd.read_csv("PoliceKillingsUS.csv")

In [5]:
df.head()

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera
0,3,Tim Elliot,02/01/15,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False
1,4,Lewis Lee Lembke,02/01/15,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False
2,5,John Paul Quintero,03/01/15,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False
3,8,Matthew Hoffman,04/01/15,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False
4,9,Michael Rodriguez,04/01/15,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False

# 4. DataFrame.fillna()

In [6]:
#clean the dataset of column 'armed' and replace the No values with 'other'

df['armed'].fillna(value='other', inplace=True)
df.armed

0              gun
1              gun
2          unarmed
3       toy weapon
4         nail gun
           ...
2530           gun
2531       vehicle
2532           gun
2533       vehicle
2534         knife
Name: armed, Length: 2535, dtype: object

# 5. Sorting DataFrame

In [7]:
#now let us create our own datasets and perform the operations

students = [ ('Jack', 34, 'Sydney') ,

             ('Riti', 31, 'Delhi' ) ,

             ('Aadi', 16, 'New York') ,

             ('Riti', 32, 'Delhi' ) ,

             ('Riti', 33, 'Delhi' ) ,

             ('Riti', 35, 'Mumbai' ),

             ('Ajay', 21, 'Hyderabad')

             ]

In [8]:
#create a dataframe object
df3=pd.DataFrame(students,columns=['Name','Marks','City'], index=['b','a','f','e','d','c','g'])
df3

   Name  Marks       City
b  Jack     34     Sydney
a  Riti     31      Delhi
f  Aadi     16   New York
e  Riti     32      Delhi
d  Riti     33      Delhi
c  Riti     35     Mumbai
g  Ajay     21  Hyderabad

In [9]:
#observe the difference between below 3 operations on sort function

#let us perform the sort by index
df3.sort_index()

   Name  Marks       City
a  Riti     31      Delhi
b  Jack     34     Sydney
c  Riti     35     Mumbai
d  Riti     33      Delhi
e  Riti     32      Delhi
f  Aadi     16   New York
g  Ajay     21  Hyderabad